CSI API ETABS v1
cPropMaterial.GetNameList Method
 Retrieves the names of all defined material properties of the specified type.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName,
	eMatType MatType =
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	Optional MatType As eMatType =
) As Integer
Dim instance As cPropMaterial
Dim NumberNames As Integer
Dim MyName As String()
Dim MatType As eMatType
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName, MatType)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName,
	eMatType MatType =
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref *
        ?MatType : eMatType
(* Defaults:
        let _MatType = defaultArg MatType
*)
-> int
Parameters
NumberNames
Type: System.Int32
The number of material property names retrieved by the program.
MyName
Type: System.String[]
One-dimensional array of material property names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames - 1) inside the program, filled with the names, and returned to the API user.
MatType (Optional)
Type: ETABSv1.eMatType
This optional value is one of the items in the eMatType enumeration.
If no value is input for MatType, names are returned for all material properties in the model regardless of type.
Return Value
Type: Int32
Returns zero if the names are successfully retrieved; otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberNames As Integer
       Dim MyName() As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get material property names
       ret = SapModel.PropMaterial.GetNameList(NumberNames, MyName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace